app/controllers/school_classes_controller.rb

INSERT INTO "school_classes" ("title", "room_number") VALUES (?, ?)  [["title", "waffle tossing"], ["room_number", 323]]
---
  def create
    @school_class = SchoolClass.create(params.require(:school_class).permit(:title, :room_number))